dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_CYW9P62S1_43012EVB_01/SDIO_HOST/SDIO_HOST_cfg.h
#if !defined(CY_SDIO_CFG_H)
#define CY_SDIO_CFG_H

#include <string.h>

#include "cy_dma.h"
#include "cy_sysclk.h"
#include "cy_trigmux.h"


#if defined(__cplusplus)
extern "C" {
#endif

#define CYREG_PROT_SMPU_MS0_CTL 0x40240000u
#define CYREG_PROT_SMPU_MS1_CTL 0x40240004u
#define CYREG_PROT_SMPU_MS2_CTL 0x40240008u
#define CYREG_PROT_SMPU_MS3_CTL 0x4024000cu
#define CYREG_PROT_SMPU_MS14_CTL 0x40240038u

#define CYDEV_UDB_UDBPAIR1_UDBSNG0_BASE 0x40342200u
#define CYDEV_UDB_UDBPAIR0_UDBSNG1_BASE 0x40342080u

#define CYREG_UDB_UDBPAIR0_UDBSNG0_RC_CFG0 0x4034205cu
#define CYREG_UDB_UDBPAIR0_UDBSNG1_RC_CFG0 0x403420dcu

#define CYREG_UDB_UDBPAIR1_UDBSNG0_RC_CFG0 0x4034225cu
#define CYREG_UDB_UDBPAIR1_UDBSNG1_RC_CFG0 0x403422dcu

#define CYREG_UDB_UDBPAIR2_UDBSNG0_RC_CFG0 0x4034245cu
#define CYREG_UDB_UDBPAIR2_UDBSNG1_RC_CFG0 0x403424dcu
#define CYREG_UDB_UDBPAIR3_UDBSNG0_RC_CFG0 0x4034265cu
#define CYREG_UDB_UDBPAIR3_UDBSNG1_RC_CFG0 0x403426dcu
#define CYREG_UDB_UDBPAIR4_UDBSNG0_RC_CFG0 0x4034285cu
#define CYREG_UDB_UDBPAIR4_UDBSNG1_RC_CFG0 0x403428dcu
#define CYREG_UDB_UDBPAIR5_UDBSNG0_RC_CFG0 0x40342a5cu
#define CYREG_UDB_UDBPAIR5_UDBSNG1_RC_CFG0 0x40342adcu

#define CYDEV_UDB_UDBPAIR4_UDBSNG0_BASE 0x40342800u
#define CYDEV_UDB_UDBPAIR3_UDBSNG1_BASE 0x40342680u
#define CYDEV_UDB_UDBPAIR1_UDBSNG1_BASE 0x40342280u
#define CYDEV_UDB_UDBPAIR0_UDBSNG0_BASE 0x40342000u

#define CYDEV_UDB_UDBPAIR0_ROUTE_BASE 0x40342100u
#define CYDEV_UDB_UDBPAIR1_ROUTE_BASE 0x40342300u
#define CYDEV_UDB_UDBPAIR2_ROUTE_BASE 0x40342500u
#define CYDEV_UDB_UDBPAIR3_ROUTE_BASE 0x40342700u
#define CYDEV_UDB_UDBPAIR4_ROUTE_BASE 0x40342900u
#define CYDEV_UDB_UDBPAIR5_ROUTE_BASE 0x40342b00u


#define CYDEV_UDB_UDBPAIR2_UDBSNG0_BASE 0x40342400u
#define CYDEV_UDB_UDBPAIR2_UDBSNG1_BASE 0x40342480u
#define CYDEV_UDB_UDBPAIR3_UDBSNG0_BASE 0x40342600u
#define CYDEV_UDB_UDBPAIR4_UDBSNG1_BASE 0x40342880u
#define CYDEV_UDB_UDBPAIR5_UDBSNG0_BASE 0x40342a00u
#define CYDEV_UDB_UDBPAIR5_UDBSNG1_BASE 0x40342a80u


#define CYDEV_UDB_DSI0_BASE 0x40346000u
#define CYDEV_UDB_DSI1_BASE 0x40346080u
#define CYDEV_UDB_DSI2_BASE 0x40346100u
#define CYDEV_UDB_DSI3_BASE 0x40346180u
#define CYDEV_UDB_DSI4_BASE 0x40346200u
#define CYDEV_UDB_DSI5_BASE 0x40346280u
#define CYDEV_UDB_DSI6_BASE 0x40346300u
#define CYDEV_UDB_DSI7_BASE 0x40346380u
#define CYDEV_UDB_DSI8_BASE 0x40346400u
#define CYDEV_UDB_DSI9_BASE 0x40346480u
#define CYDEV_UDB_DSI10_BASE 0x40346500u
#define CYDEV_UDB_DSI11_BASE 0x40346580u

#define CYREG_UDB_UDBIF_INT_CLK_CTL 0x40347904u

/*************Defines for UDBs from Creator*****************************/
/***********These come for cyfitter.h**********************************/
/* SDIO_HOST_bSDIO */
#define SDIO_HOST_bSDIO_blockCounter_u0__16BIT_A0_REG 0x40341000u
#define SDIO_HOST_bSDIO_blockCounter_u0__16BIT_A1_REG 0x40341100u
#define SDIO_HOST_bSDIO_blockCounter_u0__16BIT_D0_REG 0x40341200u
#define SDIO_HOST_bSDIO_blockCounter_u0__16BIT_D1_REG 0x40341300u
#define SDIO_HOST_bSDIO_blockCounter_u0__16BIT_DP_AUX_CTL_REG 0x40341900u
#define SDIO_HOST_bSDIO_blockCounter_u0__16BIT_F0_REG 0x40341400u
#define SDIO_HOST_bSDIO_blockCounter_u0__16BIT_F1_REG 0x40341500u
#define SDIO_HOST_bSDIO_blockCounter_u0__32BIT_A0_REG 0x40341000u
#define SDIO_HOST_bSDIO_blockCounter_u0__32BIT_A1_REG 0x40341100u
#define SDIO_HOST_bSDIO_blockCounter_u0__32BIT_D0_REG 0x40341200u
#define SDIO_HOST_bSDIO_blockCounter_u0__32BIT_D1_REG 0x40341300u
#define SDIO_HOST_bSDIO_blockCounter_u0__32BIT_DP_AUX_CTL_REG 0x40341900u
#define SDIO_HOST_bSDIO_blockCounter_u0__32BIT_F0_REG 0x40341400u
#define SDIO_HOST_bSDIO_blockCounter_u0__32BIT_F1_REG 0x40341500u
#define SDIO_HOST_bSDIO_blockCounter_u0__A0_A1_REG 0x40340000u
#define SDIO_HOST_bSDIO_blockCounter_u0__A0_REG 0x40341000u
#define SDIO_HOST_bSDIO_blockCounter_u0__A1_REG 0x40341100u
#define SDIO_HOST_bSDIO_blockCounter_u0__D0_D1_REG 0x40340100u
#define SDIO_HOST_bSDIO_blockCounter_u0__D0_REG 0x40341200u
#define SDIO_HOST_bSDIO_blockCounter_u0__D1_REG 0x40341300u
#define SDIO_HOST_bSDIO_blockCounter_u0__DP_AUX_CTL_REG 0x40341900u
#define SDIO_HOST_bSDIO_blockCounter_u0__DPATH_CFG0 0x40342040u
#define SDIO_HOST_bSDIO_blockCounter_u0__DPATH_CFG1 0x40342044u
#define SDIO_HOST_bSDIO_blockCounter_u0__DPATH_CFG2 0x40342048u
#define SDIO_HOST_bSDIO_blockCounter_u0__DPATH_CFG3 0x4034204Cu
#define SDIO_HOST_bSDIO_blockCounter_u0__DPATH_CFG4 0x40342050u
#define SDIO_HOST_bSDIO_blockCounter_u0__DPATH_OPC0 0x40342064u
#define SDIO_HOST_bSDIO_blockCounter_u0__DPATH_OPC1 0x40342068u
#define SDIO_HOST_bSDIO_blockCounter_u0__DPATH_OPC2 0x4034206Cu
#define SDIO_HOST_bSDIO_blockCounter_u0__DPATH_OPC3 0x40342070u
#define SDIO_HOST_bSDIO_blockCounter_u0__F0_F1_REG 0x40340200u
#define SDIO_HOST_bSDIO_blockCounter_u0__F0_REG 0x40341400u
#define SDIO_HOST_bSDIO_blockCounter_u0__F1_REG 0x40341500u
#define SDIO_HOST_bSDIO_blockCounter_u0__MSK_DP_AUX_CTL_REG 0x40340400u
#define SDIO_HOST_bSDIO_blockCounter_u0__PER_DP_AUX_CTL_REG 0x40340400u
#define SDIO_HOST_bSDIO_blockCounter_u0__RC_CFG0 0x4034205Cu
#define SDIO_HOST_bSDIO_blockCounter_u0__RC_CFG1 0x40342060u
#define SDIO_HOST_bSDIO_byteCounter__16BIT_CONTROL_AUX_CTL_REG 0x40341928u
#define SDIO_HOST_bSDIO_byteCounter__16BIT_CONTROL_CONTROL_REG 0x40341728u
#define SDIO_HOST_bSDIO_byteCounter__16BIT_CONTROL_COUNT_REG 0x40341728u
#define SDIO_HOST_bSDIO_byteCounter__16BIT_COUNT_CONTROL_REG 0x40341728u
#define SDIO_HOST_bSDIO_byteCounter__16BIT_COUNT_COUNT_REG 0x40341728u
#define SDIO_HOST_bSDIO_byteCounter__16BIT_MASK_MASK_REG 0x40341828u
#define SDIO_HOST_bSDIO_byteCounter__16BIT_MASK_PERIOD_REG 0x40341828u
#define SDIO_HOST_bSDIO_byteCounter__16BIT_PERIOD_MASK_REG 0x40341828u
#define SDIO_HOST_bSDIO_byteCounter__16BIT_PERIOD_PERIOD_REG 0x40341828u
#define SDIO_HOST_bSDIO_byteCounter__CONTROL_AUX_CTL_REG 0x40341928u
#define SDIO_HOST_bSDIO_byteCounter__CONTROL_REG 0x40341728u
#define SDIO_HOST_bSDIO_byteCounter__CONTROL_ST_REG 0x40340328u
#define SDIO_HOST_bSDIO_byteCounter__COUNT_REG 0x40341728u
#define SDIO_HOST_bSDIO_byteCounter__COUNT_ST_REG 0x40340328u
#define SDIO_HOST_bSDIO_byteCounter__MASK_CTL_AUX_CTL_REG 0x40340428u
#define SDIO_HOST_bSDIO_byteCounter__PER_CTL_AUX_CTL_REG 0x40340428u
#define SDIO_HOST_bSDIO_byteCounter__PERIOD_REG 0x40341828u
#define SDIO_HOST_bSDIO_byteCounter__RC_CFG0 0x40342A5Cu
#define SDIO_HOST_bSDIO_byteCounter__RC_CFG1 0x40342A60u
#define SDIO_HOST_bSDIO_byteCounter__SC_CFG0 0x40342A54u
#define SDIO_HOST_bSDIO_byteCounter__SC_CFG1 0x40342A58u
#define SDIO_HOST_bSDIO_byteCounter_ST__16BIT_STATUS_AUX_CTL_REG 0x40341928u
#define SDIO_HOST_bSDIO_byteCounter_ST__16BIT_STATUS_REG 0x40341628u
#define SDIO_HOST_bSDIO_byteCounter_ST__MASK_REG 0x40341828u
#define SDIO_HOST_bSDIO_byteCounter_ST__MASK_ST_AUX_CTL_REG 0x40340428u
#define SDIO_HOST_bSDIO_byteCounter_ST__PER_ST_AUX_CTL_REG 0x40340428u
#define SDIO_HOST_bSDIO_byteCounter_ST__RC_CFG0 0x40342A5Cu
#define SDIO_HOST_bSDIO_byteCounter_ST__RC_CFG1 0x40342A60u
#define SDIO_HOST_bSDIO_byteCounter_ST__SC_CFG0 0x40342A54u
#define SDIO_HOST_bSDIO_byteCounter_ST__SC_CFG1 0x40342A58u
#define SDIO_HOST_bSDIO_byteCounter_ST__STATUS_AUX_CTL_REG 0x40341928u
#define SDIO_HOST_bSDIO_byteCounter_ST__STATUS_CNT_REG 0x40340328u
#define SDIO_HOST_bSDIO_byteCounter_ST__STATUS_CONTROL_REG 0x40340328u
#define SDIO_HOST_bSDIO_byteCounter_ST__STATUS_REG 0x40341628u
#define SDIO_HOST_bSDIO_CMD__16BIT_A0_REG 0x40341028u
#define SDIO_HOST_bSDIO_CMD__16BIT_A1_REG 0x40341128u
#define SDIO_HOST_bSDIO_CMD__16BIT_D0_REG 0x40341228u
#define SDIO_HOST_bSDIO_CMD__16BIT_D1_REG 0x40341328u
#define SDIO_HOST_bSDIO_CMD__16BIT_DP_AUX_CTL_REG 0x40341928u
#define SDIO_HOST_bSDIO_CMD__16BIT_F0_REG 0x40341428u
#define SDIO_HOST_bSDIO_CMD__16BIT_F1_REG 0x40341528u
#define SDIO_HOST_bSDIO_CMD__A0_A1_REG 0x40340028u
#define SDIO_HOST_bSDIO_CMD__A0_REG 0x40341028u
#define SDIO_HOST_bSDIO_CMD__A1_REG 0x40341128u
#define SDIO_HOST_bSDIO_CMD__D0_D1_REG 0x40340128u
#define SDIO_HOST_bSDIO_CMD__D0_REG 0x40341228u
#define SDIO_HOST_bSDIO_CMD__D1_REG 0x40341328u
#define SDIO_HOST_bSDIO_CMD__DP_AUX_CTL_REG 0x40341928u
#define SDIO_HOST_bSDIO_CMD__DPATH_CFG0 0x40342A40u
#define SDIO_HOST_bSDIO_CMD__DPATH_CFG1 0x40342A44u
#define SDIO_HOST_bSDIO_CMD__DPATH_CFG2 0x40342A48u
#define SDIO_HOST_bSDIO_CMD__DPATH_CFG3 0x40342A4Cu
#define SDIO_HOST_bSDIO_CMD__DPATH_CFG4 0x40342A50u
#define SDIO_HOST_bSDIO_CMD__DPATH_OPC0 0x40342A64u
#define SDIO_HOST_bSDIO_CMD__DPATH_OPC1 0x40342A68u
#define SDIO_HOST_bSDIO_CMD__DPATH_OPC2 0x40342A6Cu
#define SDIO_HOST_bSDIO_CMD__DPATH_OPC3 0x40342A70u
#define SDIO_HOST_bSDIO_CMD__F0_F1_REG 0x40340228u
#define SDIO_HOST_bSDIO_CMD__F0_REG 0x40341428u
#define SDIO_HOST_bSDIO_CMD__F1_REG 0x40341528u
#define SDIO_HOST_bSDIO_CMD__MSK_DP_AUX_CTL_REG 0x40340428u
#define SDIO_HOST_bSDIO_CMD__PER_DP_AUX_CTL_REG 0x40340428u
#define SDIO_HOST_bSDIO_CMD__RC_CFG0 0x40342A5Cu
#define SDIO_HOST_bSDIO_CMD__RC_CFG1 0x40342A60u
#define SDIO_HOST_bSDIO_cmdBitCounter__16BIT_CONTROL_AUX_CTL_REG 0x40341900u
#define SDIO_HOST_bSDIO_cmdBitCounter__16BIT_CONTROL_CONTROL_REG 0x40341700u
#define SDIO_HOST_bSDIO_cmdBitCounter__16BIT_CONTROL_COUNT_REG 0x40341700u
#define SDIO_HOST_bSDIO_cmdBitCounter__16BIT_COUNT_CONTROL_REG 0x40341700u
#define SDIO_HOST_bSDIO_cmdBitCounter__16BIT_COUNT_COUNT_REG 0x40341700u
#define SDIO_HOST_bSDIO_cmdBitCounter__16BIT_MASK_MASK_REG 0x40341800u
#define SDIO_HOST_bSDIO_cmdBitCounter__16BIT_MASK_PERIOD_REG 0x40341800u
#define SDIO_HOST_bSDIO_cmdBitCounter__16BIT_PERIOD_MASK_REG 0x40341800u
#define SDIO_HOST_bSDIO_cmdBitCounter__16BIT_PERIOD_PERIOD_REG 0x40341800u
#define SDIO_HOST_bSDIO_cmdBitCounter__32BIT_CONTROL_AUX_CTL_REG 0x40341900u
#define SDIO_HOST_bSDIO_cmdBitCounter__32BIT_CONTROL_REG 0x40341700u
#define SDIO_HOST_bSDIO_cmdBitCounter__32BIT_COUNT_REG 0x40341700u
#define SDIO_HOST_bSDIO_cmdBitCounter__32BIT_PERIOD_REG 0x40341800u
#define SDIO_HOST_bSDIO_cmdBitCounter__CONTROL_AUX_CTL_REG 0x40341900u
#define SDIO_HOST_bSDIO_cmdBitCounter__CONTROL_REG 0x40341700u
#define SDIO_HOST_bSDIO_cmdBitCounter__CONTROL_ST_REG 0x40340300u
#define SDIO_HOST_bSDIO_cmdBitCounter__COUNT_REG 0x40341700u
#define SDIO_HOST_bSDIO_cmdBitCounter__COUNT_ST_REG 0x40340300u
#define SDIO_HOST_bSDIO_cmdBitCounter__MASK_CTL_AUX_CTL_REG 0x40340400u
#define SDIO_HOST_bSDIO_cmdBitCounter__PER_CTL_AUX_CTL_REG 0x40340400u
#define SDIO_HOST_bSDIO_cmdBitCounter__PERIOD_REG 0x40341800u
#define SDIO_HOST_bSDIO_cmdBitCounter__RC_CFG0 0x4034205Cu
#define SDIO_HOST_bSDIO_cmdBitCounter__RC_CFG1 0x40342060u
#define SDIO_HOST_bSDIO_cmdBitCounter__SC_CFG0 0x40342054u
#define SDIO_HOST_bSDIO_cmdBitCounter__SC_CFG1 0x40342058u
#define SDIO_HOST_bSDIO_cmdBitCounter_ST__16BIT_STATUS_AUX_CTL_REG 0x40341900u
#define SDIO_HOST_bSDIO_cmdBitCounter_ST__16BIT_STATUS_REG 0x40341600u
#define SDIO_HOST_bSDIO_cmdBitCounter_ST__32BIT_MASK_REG 0x40341800u
#define SDIO_HOST_bSDIO_cmdBitCounter_ST__32BIT_STATUS_AUX_CTL_REG 0x40341900u
#define SDIO_HOST_bSDIO_cmdBitCounter_ST__32BIT_STATUS_REG 0x40341600u
#define SDIO_HOST_bSDIO_cmdBitCounter_ST__MASK_REG 0x40341800u
#define SDIO_HOST_bSDIO_cmdBitCounter_ST__MASK_ST_AUX_CTL_REG 0x40340400u
#define SDIO_HOST_bSDIO_cmdBitCounter_ST__PER_ST_AUX_CTL_REG 0x40340400u
#define SDIO_HOST_bSDIO_cmdBitCounter_ST__RC_CFG0 0x4034205Cu
#define SDIO_HOST_bSDIO_cmdBitCounter_ST__RC_CFG1 0x40342060u
#define SDIO_HOST_bSDIO_cmdBitCounter_ST__SC_CFG0 0x40342054u
#define SDIO_HOST_bSDIO_cmdBitCounter_ST__SC_CFG1 0x40342058u
#define SDIO_HOST_bSDIO_cmdBitCounter_ST__STATUS_AUX_CTL_REG 0x40341900u
#define SDIO_HOST_bSDIO_cmdBitCounter_ST__STATUS_CNT_REG 0x40340300u
#define SDIO_HOST_bSDIO_cmdBitCounter_ST__STATUS_CONTROL_REG 0x40340300u
#define SDIO_HOST_bSDIO_cmdBitCounter_ST__STATUS_REG 0x40341600u
#define SDIO_HOST_bSDIO_crcBitCounter__16BIT_CONTROL_AUX_CTL_REG 0x40341920u
#define SDIO_HOST_bSDIO_crcBitCounter__16BIT_CONTROL_CONTROL_REG 0x40341720u
#define SDIO_HOST_bSDIO_crcBitCounter__16BIT_CONTROL_COUNT_REG 0x40341720u
#define SDIO_HOST_bSDIO_crcBitCounter__16BIT_COUNT_CONTROL_REG 0x40341720u
#define SDIO_HOST_bSDIO_crcBitCounter__16BIT_COUNT_COUNT_REG 0x40341720u
#define SDIO_HOST_bSDIO_crcBitCounter__16BIT_MASK_MASK_REG 0x40341820u
#define SDIO_HOST_bSDIO_crcBitCounter__16BIT_MASK_PERIOD_REG 0x40341820u
#define SDIO_HOST_bSDIO_crcBitCounter__16BIT_PERIOD_MASK_REG 0x40341820u
#define SDIO_HOST_bSDIO_crcBitCounter__16BIT_PERIOD_PERIOD_REG 0x40341820u
#define SDIO_HOST_bSDIO_crcBitCounter__32BIT_CONTROL_AUX_CTL_REG 0x40341920u
#define SDIO_HOST_bSDIO_crcBitCounter__32BIT_CONTROL_REG 0x40341720u
#define SDIO_HOST_bSDIO_crcBitCounter__32BIT_COUNT_REG 0x40341720u
#define SDIO_HOST_bSDIO_crcBitCounter__32BIT_PERIOD_REG 0x40341820u
#define SDIO_HOST_bSDIO_crcBitCounter__CONTROL_AUX_CTL_REG 0x40341920u
#define SDIO_HOST_bSDIO_crcBitCounter__CONTROL_REG 0x40341720u
#define SDIO_HOST_bSDIO_crcBitCounter__CONTROL_ST_REG 0x40340320u
#define SDIO_HOST_bSDIO_crcBitCounter__COUNT_REG 0x40341720u
#define SDIO_HOST_bSDIO_crcBitCounter__COUNT_ST_REG 0x40340320u
#define SDIO_HOST_bSDIO_crcBitCounter__MASK_CTL_AUX_CTL_REG 0x40340420u
#define SDIO_HOST_bSDIO_crcBitCounter__PER_CTL_AUX_CTL_REG 0x40340420u
#define SDIO_HOST_bSDIO_crcBitCounter__PERIOD_REG 0x40341820u
#define SDIO_HOST_bSDIO_crcBitCounter__RC_CFG0 0x4034285Cu
#define SDIO_HOST_bSDIO_crcBitCounter__RC_CFG1 0x40342860u
#define SDIO_HOST_bSDIO_crcBitCounter__SC_CFG0 0x40342854u
#define SDIO_HOST_bSDIO_crcBitCounter__SC_CFG1 0x40342858u
#define SDIO_HOST_bSDIO_crcBitCounter_ST__16BIT_STATUS_AUX_CTL_REG 0x40341920u
#define SDIO_HOST_bSDIO_crcBitCounter_ST__16BIT_STATUS_REG 0x40341620u
#define SDIO_HOST_bSDIO_crcBitCounter_ST__32BIT_MASK_REG 0x40341820u
#define SDIO_HOST_bSDIO_crcBitCounter_ST__32BIT_STATUS_AUX_CTL_REG 0x40341920u
#define SDIO_HOST_bSDIO_crcBitCounter_ST__32BIT_STATUS_REG 0x40341620u
#define SDIO_HOST_bSDIO_crcBitCounter_ST__MASK_REG 0x40341820u
#define SDIO_HOST_bSDIO_crcBitCounter_ST__MASK_ST_AUX_CTL_REG 0x40340420u
#define SDIO_HOST_bSDIO_crcBitCounter_ST__PER_ST_AUX_CTL_REG 0x40340420u
#define SDIO_HOST_bSDIO_crcBitCounter_ST__RC_CFG0 0x4034285Cu
#define SDIO_HOST_bSDIO_crcBitCounter_ST__RC_CFG1 0x40342860u
#define SDIO_HOST_bSDIO_crcBitCounter_ST__SC_CFG0 0x40342854u
#define SDIO_HOST_bSDIO_crcBitCounter_ST__SC_CFG1 0x40342858u
#define SDIO_HOST_bSDIO_crcBitCounter_ST__STATUS_AUX_CTL_REG 0x40341920u
#define SDIO_HOST_bSDIO_crcBitCounter_ST__STATUS_CNT_REG 0x40340320u
#define SDIO_HOST_bSDIO_crcBitCounter_ST__STATUS_CONTROL_REG 0x40340320u
#define SDIO_HOST_bSDIO_crcBitCounter_ST__STATUS_REG 0x40341620u
#define SDIO_HOST_bSDIO_CtrlReg__0__MASK 0x01u
#define SDIO_HOST_bSDIO_CtrlReg__0__POS 0
#define SDIO_HOST_bSDIO_CtrlReg__1__MASK 0x02u
#define SDIO_HOST_bSDIO_CtrlReg__1__POS 1
#define SDIO_HOST_bSDIO_CtrlReg__16BIT_CONTROL_AUX_CTL_REG 0x40341910u
#define SDIO_HOST_bSDIO_CtrlReg__16BIT_CONTROL_CONTROL_REG 0x40341710u
#define SDIO_HOST_bSDIO_CtrlReg__16BIT_CONTROL_COUNT_REG 0x40341710u
#define SDIO_HOST_bSDIO_CtrlReg__16BIT_COUNT_CONTROL_REG 0x40341710u
#define SDIO_HOST_bSDIO_CtrlReg__16BIT_COUNT_COUNT_REG 0x40341710u
#define SDIO_HOST_bSDIO_CtrlReg__16BIT_MASK_MASK_REG 0x40341810u
#define SDIO_HOST_bSDIO_CtrlReg__16BIT_MASK_PERIOD_REG 0x40341810u
#define SDIO_HOST_bSDIO_CtrlReg__16BIT_PERIOD_MASK_REG 0x40341810u
#define SDIO_HOST_bSDIO_CtrlReg__16BIT_PERIOD_PERIOD_REG 0x40341810u
#define SDIO_HOST_bSDIO_CtrlReg__2__MASK 0x04u
#define SDIO_HOST_bSDIO_CtrlReg__2__POS 2
#define SDIO_HOST_bSDIO_CtrlReg__3__MASK 0x08u
#define SDIO_HOST_bSDIO_CtrlReg__3__POS 3
#define SDIO_HOST_bSDIO_CtrlReg__32BIT_CONTROL_AUX_CTL_REG 0x40341910u
#define SDIO_HOST_bSDIO_CtrlReg__32BIT_CONTROL_REG 0x40341710u
#define SDIO_HOST_bSDIO_CtrlReg__32BIT_COUNT_REG 0x40341710u
#define SDIO_HOST_bSDIO_CtrlReg__32BIT_PERIOD_REG 0x40341810u
#define SDIO_HOST_bSDIO_CtrlReg__4__MASK 0x10u
#define SDIO_HOST_bSDIO_CtrlReg__4__POS 4
#define SDIO_HOST_bSDIO_CtrlReg__6__MASK 0x40u
#define SDIO_HOST_bSDIO_CtrlReg__6__POS 6
#define SDIO_HOST_bSDIO_CtrlReg__7__MASK 0x80u
#define SDIO_HOST_bSDIO_CtrlReg__7__POS 7
#define SDIO_HOST_bSDIO_CtrlReg__CONTROL_AUX_CTL_REG 0x40341910u
#define SDIO_HOST_bSDIO_CtrlReg__CONTROL_REG 0x40341710u
#define SDIO_HOST_bSDIO_CtrlReg__CONTROL_ST_REG 0x40340310u
#define SDIO_HOST_bSDIO_CtrlReg__COUNT_REG 0x40341710u
#define SDIO_HOST_bSDIO_CtrlReg__COUNT_ST_REG 0x40340310u
#define SDIO_HOST_bSDIO_CtrlReg__MASK 0xDFu
#define SDIO_HOST_bSDIO_CtrlReg__MASK_CTL_AUX_CTL_REG 0x40340410u
#define SDIO_HOST_bSDIO_CtrlReg__PER_CTL_AUX_CTL_REG 0x40340410u
#define SDIO_HOST_bSDIO_CtrlReg__PERIOD_REG 0x40341810u
#define SDIO_HOST_bSDIO_CtrlReg__RC_CFG0 0x4034245Cu
#define SDIO_HOST_bSDIO_CtrlReg__RC_CFG1 0x40342460u
#define SDIO_HOST_bSDIO_CtrlReg__SC_CFG0 0x40342454u
#define SDIO_HOST_bSDIO_CtrlReg__SC_CFG1 0x40342458u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__16BIT_A0_REG 0x40341018u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__16BIT_A1_REG 0x40341118u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__16BIT_D0_REG 0x40341218u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__16BIT_D1_REG 0x40341318u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__16BIT_DP_AUX_CTL_REG 0x40341918u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__16BIT_F0_REG 0x40341418u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__16BIT_F1_REG 0x40341518u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__32BIT_A0_REG 0x40341018u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__32BIT_A1_REG 0x40341118u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__32BIT_D0_REG 0x40341218u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__32BIT_D1_REG 0x40341318u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__32BIT_DP_AUX_CTL_REG 0x40341918u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__32BIT_F0_REG 0x40341418u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__32BIT_F1_REG 0x40341518u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__A0_A1_REG 0x40340018u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__A0_REG 0x40341018u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__A1_REG 0x40341118u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__D0_D1_REG 0x40340118u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__D0_REG 0x40341218u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__D1_REG 0x40341318u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__DP_AUX_CTL_REG 0x40341918u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__DPATH_CFG0 0x40342640u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__DPATH_CFG1 0x40342644u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__DPATH_CFG2 0x40342648u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__DPATH_CFG3 0x4034264Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__DPATH_CFG4 0x40342650u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__DPATH_OPC0 0x40342664u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__DPATH_OPC1 0x40342668u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__DPATH_OPC2 0x4034266Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__DPATH_OPC3 0x40342670u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__F0_F1_REG 0x40340218u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__F0_REG 0x40341418u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__F1_REG 0x40341518u
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__RC_CFG0 0x4034265Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u0__RC_CFG1 0x40342660u
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__16BIT_A0_REG 0x4034101Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__16BIT_A1_REG 0x4034111Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__16BIT_D0_REG 0x4034121Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__16BIT_D1_REG 0x4034131Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__16BIT_DP_AUX_CTL_REG 0x4034191Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__16BIT_F0_REG 0x4034141Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__16BIT_F1_REG 0x4034151Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__32BIT_A0_REG 0x4034101Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__32BIT_A1_REG 0x4034111Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__32BIT_D0_REG 0x4034121Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__32BIT_D1_REG 0x4034131Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__32BIT_DP_AUX_CTL_REG 0x4034191Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__32BIT_F0_REG 0x4034141Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__32BIT_F1_REG 0x4034151Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__A0_A1_REG 0x4034001Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__A0_REG 0x4034101Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__A1_REG 0x4034111Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__D0_D1_REG 0x4034011Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__D0_REG 0x4034121Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__D1_REG 0x4034131Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__DP_AUX_CTL_REG 0x4034191Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__DPATH_CFG0 0x403426C0u
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__DPATH_CFG1 0x403426C4u
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__DPATH_CFG2 0x403426C8u
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__DPATH_CFG3 0x403426CCu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__DPATH_CFG4 0x403426D0u
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__DPATH_OPC0 0x403426E4u
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__DPATH_OPC1 0x403426E8u
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__DPATH_OPC2 0x403426ECu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__DPATH_OPC3 0x403426F0u
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__F0_F1_REG 0x4034021Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__F0_REG 0x4034141Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__F1_REG 0x4034151Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__MSK_DP_AUX_CTL_REG 0x4034041Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__PER_DP_AUX_CTL_REG 0x4034041Cu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__RC_CFG0 0x403426DCu
#define SDIO_HOST_bSDIO_DAT_CRC0_u1__RC_CFG1 0x403426E0u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__16BIT_A0_REG 0x40341010u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__16BIT_A1_REG 0x40341110u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__16BIT_D0_REG 0x40341210u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__16BIT_D1_REG 0x40341310u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__16BIT_DP_AUX_CTL_REG 0x40341910u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__16BIT_F0_REG 0x40341410u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__16BIT_F1_REG 0x40341510u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__32BIT_A0_REG 0x40341010u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__32BIT_A1_REG 0x40341110u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__32BIT_D0_REG 0x40341210u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__32BIT_D1_REG 0x40341310u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__32BIT_DP_AUX_CTL_REG 0x40341910u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__32BIT_F0_REG 0x40341410u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__32BIT_F1_REG 0x40341510u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__A0_A1_REG 0x40340010u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__A0_REG 0x40341010u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__A1_REG 0x40341110u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__D0_D1_REG 0x40340110u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__D0_REG 0x40341210u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__D1_REG 0x40341310u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__DP_AUX_CTL_REG 0x40341910u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__DPATH_CFG0 0x40342440u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__DPATH_CFG1 0x40342444u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__DPATH_CFG2 0x40342448u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__DPATH_CFG3 0x4034244Cu
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__DPATH_CFG4 0x40342450u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__DPATH_OPC0 0x40342464u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__DPATH_OPC1 0x40342468u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__DPATH_OPC2 0x4034246Cu
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__DPATH_OPC3 0x40342470u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__F0_F1_REG 0x40340210u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__F0_REG 0x40341410u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__F1_REG 0x40341510u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__MSK_DP_AUX_CTL_REG 0x40340410u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__PER_DP_AUX_CTL_REG 0x40340410u
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__RC_CFG0 0x4034245Cu
#define SDIO_HOST_bSDIO_DAT_CRC1_u0__RC_CFG1 0x40342460u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__16BIT_A0_REG 0x40341014u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__16BIT_A1_REG 0x40341114u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__16BIT_D0_REG 0x40341214u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__16BIT_D1_REG 0x40341314u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__16BIT_DP_AUX_CTL_REG 0x40341914u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__16BIT_F0_REG 0x40341414u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__16BIT_F1_REG 0x40341514u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__32BIT_A0_REG 0x40341014u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__32BIT_A1_REG 0x40341114u
