dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_CYW9P62S1_43012EVB_01/SDIO_HOST/SDIO_HOST_cfg.h
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__32BIT_D0_REG 0x40341214u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__32BIT_D1_REG 0x40341314u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__32BIT_DP_AUX_CTL_REG 0x40341914u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__32BIT_F0_REG 0x40341414u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__32BIT_F1_REG 0x40341514u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__A0_A1_REG 0x40340014u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__A0_REG 0x40341014u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__A1_REG 0x40341114u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__D0_D1_REG 0x40340114u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__D0_REG 0x40341214u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__D1_REG 0x40341314u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__DP_AUX_CTL_REG 0x40341914u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__DPATH_CFG0 0x403424C0u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__DPATH_CFG1 0x403424C4u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__DPATH_CFG2 0x403424C8u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__DPATH_CFG3 0x403424CCu
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__DPATH_CFG4 0x403424D0u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__DPATH_OPC0 0x403424E4u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__DPATH_OPC1 0x403424E8u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__DPATH_OPC2 0x403424ECu
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__DPATH_OPC3 0x403424F0u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__F0_F1_REG 0x40340214u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__F0_REG 0x40341414u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__F1_REG 0x40341514u
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__RC_CFG0 0x403424DCu
#define SDIO_HOST_bSDIO_DAT_CRC1_u1__RC_CFG1 0x403424E0u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__16BIT_A0_REG 0x40341020u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__16BIT_A1_REG 0x40341120u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__16BIT_D0_REG 0x40341220u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__16BIT_D1_REG 0x40341320u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__16BIT_DP_AUX_CTL_REG 0x40341920u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__16BIT_F0_REG 0x40341420u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__16BIT_F1_REG 0x40341520u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__32BIT_A0_REG 0x40341020u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__32BIT_A1_REG 0x40341120u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__32BIT_D0_REG 0x40341220u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__32BIT_D1_REG 0x40341320u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__32BIT_DP_AUX_CTL_REG 0x40341920u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__32BIT_F0_REG 0x40341420u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__32BIT_F1_REG 0x40341520u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__A0_A1_REG 0x40340020u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__A0_REG 0x40341020u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__A1_REG 0x40341120u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__D0_D1_REG 0x40340120u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__D0_REG 0x40341220u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__D1_REG 0x40341320u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__DP_AUX_CTL_REG 0x40341920u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__DPATH_CFG0 0x40342840u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__DPATH_CFG1 0x40342844u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__DPATH_CFG2 0x40342848u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__DPATH_CFG3 0x4034284Cu
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__DPATH_CFG4 0x40342850u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__DPATH_OPC0 0x40342864u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__DPATH_OPC1 0x40342868u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__DPATH_OPC2 0x4034286Cu
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__DPATH_OPC3 0x40342870u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__F0_F1_REG 0x40340220u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__F0_REG 0x40341420u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__F1_REG 0x40341520u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__MSK_DP_AUX_CTL_REG 0x40340420u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__PER_DP_AUX_CTL_REG 0x40340420u
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__RC_CFG0 0x4034285Cu
#define SDIO_HOST_bSDIO_DAT_CRC2_u0__RC_CFG1 0x40342860u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__16BIT_A0_REG 0x40341024u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__16BIT_A1_REG 0x40341124u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__16BIT_D0_REG 0x40341224u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__16BIT_D1_REG 0x40341324u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__16BIT_DP_AUX_CTL_REG 0x40341924u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__16BIT_F0_REG 0x40341424u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__16BIT_F1_REG 0x40341524u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__A0_A1_REG 0x40340024u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__A0_REG 0x40341024u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__A1_REG 0x40341124u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__D0_D1_REG 0x40340124u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__D0_REG 0x40341224u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__D1_REG 0x40341324u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__DP_AUX_CTL_REG 0x40341924u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__DPATH_CFG0 0x403428C0u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__DPATH_CFG1 0x403428C4u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__DPATH_CFG2 0x403428C8u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__DPATH_CFG3 0x403428CCu
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__DPATH_CFG4 0x403428D0u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__DPATH_OPC0 0x403428E4u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__DPATH_OPC1 0x403428E8u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__DPATH_OPC2 0x403428ECu
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__DPATH_OPC3 0x403428F0u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__F0_F1_REG 0x40340224u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__F0_REG 0x40341424u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__F1_REG 0x40341524u
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__RC_CFG0 0x403428DCu
#define SDIO_HOST_bSDIO_DAT_CRC2_u1__RC_CFG1 0x403428E0u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__16BIT_A0_REG 0x40341008u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__16BIT_A1_REG 0x40341108u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__16BIT_D0_REG 0x40341208u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__16BIT_D1_REG 0x40341308u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__16BIT_DP_AUX_CTL_REG 0x40341908u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__16BIT_F0_REG 0x40341408u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__16BIT_F1_REG 0x40341508u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__32BIT_A0_REG 0x40341008u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__32BIT_A1_REG 0x40341108u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__32BIT_D0_REG 0x40341208u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__32BIT_D1_REG 0x40341308u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__32BIT_DP_AUX_CTL_REG 0x40341908u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__32BIT_F0_REG 0x40341408u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__32BIT_F1_REG 0x40341508u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__A0_A1_REG 0x40340008u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__A0_REG 0x40341008u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__A1_REG 0x40341108u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__D0_D1_REG 0x40340108u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__D0_REG 0x40341208u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__D1_REG 0x40341308u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__DP_AUX_CTL_REG 0x40341908u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__DPATH_CFG0 0x40342240u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__DPATH_CFG1 0x40342244u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__DPATH_CFG2 0x40342248u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__DPATH_CFG3 0x4034224Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__DPATH_CFG4 0x40342250u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__DPATH_OPC0 0x40342264u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__DPATH_OPC1 0x40342268u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__DPATH_OPC2 0x4034226Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__DPATH_OPC3 0x40342270u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__F0_F1_REG 0x40340208u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__F0_REG 0x40341408u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__F1_REG 0x40341508u
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__RC_CFG0 0x4034225Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u0__RC_CFG1 0x40342260u
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__16BIT_A0_REG 0x4034100Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__16BIT_A1_REG 0x4034110Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__16BIT_D0_REG 0x4034120Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__16BIT_D1_REG 0x4034130Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__16BIT_DP_AUX_CTL_REG 0x4034190Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__16BIT_F0_REG 0x4034140Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__16BIT_F1_REG 0x4034150Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__32BIT_A0_REG 0x4034100Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__32BIT_A1_REG 0x4034110Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__32BIT_D0_REG 0x4034120Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__32BIT_D1_REG 0x4034130Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__32BIT_DP_AUX_CTL_REG 0x4034190Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__32BIT_F0_REG 0x4034140Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__32BIT_F1_REG 0x4034150Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__A0_A1_REG 0x4034000Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__A0_REG 0x4034100Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__A1_REG 0x4034110Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__D0_D1_REG 0x4034010Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__D0_REG 0x4034120Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__D1_REG 0x4034130Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__DP_AUX_CTL_REG 0x4034190Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__DPATH_CFG0 0x403422C0u
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__DPATH_CFG1 0x403422C4u
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__DPATH_CFG2 0x403422C8u
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__DPATH_CFG3 0x403422CCu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__DPATH_CFG4 0x403422D0u
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__DPATH_OPC0 0x403422E4u
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__DPATH_OPC1 0x403422E8u
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__DPATH_OPC2 0x403422ECu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__DPATH_OPC3 0x403422F0u
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__F0_F1_REG 0x4034020Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__F0_REG 0x4034140Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__F1_REG 0x4034150Cu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__RC_CFG0 0x403422DCu
#define SDIO_HOST_bSDIO_DAT_CRC3_u1__RC_CFG1 0x403422E0u
#define SDIO_HOST_bSDIO_Read_DP__16BIT_A0_REG 0x40341004u
#define SDIO_HOST_bSDIO_Read_DP__16BIT_A1_REG 0x40341104u
#define SDIO_HOST_bSDIO_Read_DP__16BIT_D0_REG 0x40341204u
#define SDIO_HOST_bSDIO_Read_DP__16BIT_D1_REG 0x40341304u
#define SDIO_HOST_bSDIO_Read_DP__16BIT_DP_AUX_CTL_REG 0x40341904u
#define SDIO_HOST_bSDIO_Read_DP__16BIT_F0_REG 0x40341404u
#define SDIO_HOST_bSDIO_Read_DP__16BIT_F1_REG 0x40341504u
#define SDIO_HOST_bSDIO_Read_DP__32BIT_A0_REG 0x40341004u
#define SDIO_HOST_bSDIO_Read_DP__32BIT_A1_REG 0x40341104u
#define SDIO_HOST_bSDIO_Read_DP__32BIT_D0_REG 0x40341204u
#define SDIO_HOST_bSDIO_Read_DP__32BIT_D1_REG 0x40341304u
#define SDIO_HOST_bSDIO_Read_DP__32BIT_DP_AUX_CTL_REG 0x40341904u
#define SDIO_HOST_bSDIO_Read_DP__32BIT_F0_REG 0x40341404u
#define SDIO_HOST_bSDIO_Read_DP__32BIT_F1_REG 0x40341504u
#define SDIO_HOST_bSDIO_Read_DP__A0_A1_REG 0x40340004u
#define SDIO_HOST_bSDIO_Read_DP__A0_REG 0x40341004u
#define SDIO_HOST_bSDIO_Read_DP__A1_REG 0x40341104u
#define SDIO_HOST_bSDIO_Read_DP__D0_D1_REG 0x40340104u
#define SDIO_HOST_bSDIO_Read_DP__D0_REG 0x40341204u
#define SDIO_HOST_bSDIO_Read_DP__D1_REG 0x40341304u
#define SDIO_HOST_bSDIO_Read_DP__DP_AUX_CTL_REG 0x40341904u
#define SDIO_HOST_bSDIO_Read_DP__DPATH_CFG0 0x403420C0u
#define SDIO_HOST_bSDIO_Read_DP__DPATH_CFG1 0x403420C4u
#define SDIO_HOST_bSDIO_Read_DP__DPATH_CFG2 0x403420C8u
#define SDIO_HOST_bSDIO_Read_DP__DPATH_CFG3 0x403420CCu
#define SDIO_HOST_bSDIO_Read_DP__DPATH_CFG4 0x403420D0u
#define SDIO_HOST_bSDIO_Read_DP__DPATH_OPC0 0x403420E4u
#define SDIO_HOST_bSDIO_Read_DP__DPATH_OPC1 0x403420E8u
#define SDIO_HOST_bSDIO_Read_DP__DPATH_OPC2 0x403420ECu
#define SDIO_HOST_bSDIO_Read_DP__DPATH_OPC3 0x403420F0u
#define SDIO_HOST_bSDIO_Read_DP__F0_F1_REG 0x40340204u
#define SDIO_HOST_bSDIO_Read_DP__F0_REG 0x40341404u
#define SDIO_HOST_bSDIO_Read_DP__F1_REG 0x40341504u
#define SDIO_HOST_bSDIO_Read_DP__RC_CFG0 0x403420DCu
#define SDIO_HOST_bSDIO_Read_DP__RC_CFG1 0x403420E0u
#define SDIO_HOST_bSDIO_Read_DP_PI__16BIT_STATUS_AUX_CTL_REG 0x40341904u
#define SDIO_HOST_bSDIO_Read_DP_PI__16BIT_STATUS_REG 0x40341604u
#define SDIO_HOST_bSDIO_Read_DP_PI__32BIT_MASK_REG 0x40341804u
#define SDIO_HOST_bSDIO_Read_DP_PI__32BIT_STATUS_AUX_CTL_REG 0x40341904u
#define SDIO_HOST_bSDIO_Read_DP_PI__32BIT_STATUS_REG 0x40341604u
#define SDIO_HOST_bSDIO_Read_DP_PI__MASK_REG 0x40341804u
#define SDIO_HOST_bSDIO_Read_DP_PI__RC_CFG0 0x403420DCu
#define SDIO_HOST_bSDIO_Read_DP_PI__RC_CFG1 0x403420E0u
#define SDIO_HOST_bSDIO_Read_DP_PI__SC_CFG0 0x403420D4u
#define SDIO_HOST_bSDIO_Read_DP_PI__SC_CFG1 0x403420D8u
#define SDIO_HOST_bSDIO_Read_DP_PI__STATUS_AUX_CTL_REG 0x40341904u
#define SDIO_HOST_bSDIO_Read_DP_PI__STATUS_REG 0x40341604u
#define SDIO_HOST_bSDIO_StatusReg__0__MASK 0x01u
#define SDIO_HOST_bSDIO_StatusReg__0__POS 0
#define SDIO_HOST_bSDIO_StatusReg__1__MASK 0x02u
#define SDIO_HOST_bSDIO_StatusReg__1__POS 1
#define SDIO_HOST_bSDIO_StatusReg__16BIT_STATUS_AUX_CTL_REG 0x40341910u
#define SDIO_HOST_bSDIO_StatusReg__16BIT_STATUS_REG 0x40341610u
#define SDIO_HOST_bSDIO_StatusReg__2__MASK 0x04u
#define SDIO_HOST_bSDIO_StatusReg__2__POS 2
#define SDIO_HOST_bSDIO_StatusReg__3__MASK 0x08u
#define SDIO_HOST_bSDIO_StatusReg__3__POS 3
#define SDIO_HOST_bSDIO_StatusReg__32BIT_MASK_REG 0x40341810u
#define SDIO_HOST_bSDIO_StatusReg__32BIT_STATUS_AUX_CTL_REG 0x40341910u
#define SDIO_HOST_bSDIO_StatusReg__32BIT_STATUS_REG 0x40341610u
#define SDIO_HOST_bSDIO_StatusReg__6__MASK 0x40u
#define SDIO_HOST_bSDIO_StatusReg__6__POS 6
#define SDIO_HOST_bSDIO_StatusReg__MASK 0x4Fu
#define SDIO_HOST_bSDIO_StatusReg__MASK_REG 0x40341810u
#define SDIO_HOST_bSDIO_StatusReg__MASK_ST_AUX_CTL_REG 0x40340410u
#define SDIO_HOST_bSDIO_StatusReg__PER_ST_AUX_CTL_REG 0x40340410u
#define SDIO_HOST_bSDIO_StatusReg__RC_CFG0 0x4034245Cu
#define SDIO_HOST_bSDIO_StatusReg__RC_CFG1 0x40342460u
#define SDIO_HOST_bSDIO_StatusReg__SC_CFG0 0x40342454u
#define SDIO_HOST_bSDIO_StatusReg__SC_CFG1 0x40342458u
#define SDIO_HOST_bSDIO_StatusReg__STATUS_AUX_CTL_REG 0x40341910u
#define SDIO_HOST_bSDIO_StatusReg__STATUS_CNT_REG 0x40340310u
#define SDIO_HOST_bSDIO_StatusReg__STATUS_CONTROL_REG 0x40340310u
#define SDIO_HOST_bSDIO_StatusReg__STATUS_REG 0x40341610u
#define SDIO_HOST_bSDIO_Write_DP__A0_A1_REG 0x4034002Cu
#define SDIO_HOST_bSDIO_Write_DP__A0_REG 0x4034102Cu
#define SDIO_HOST_bSDIO_Write_DP__A1_REG 0x4034112Cu
#define SDIO_HOST_bSDIO_Write_DP__D0_D1_REG 0x4034012Cu
#define SDIO_HOST_bSDIO_Write_DP__D0_REG 0x4034122Cu
#define SDIO_HOST_bSDIO_Write_DP__D1_REG 0x4034132Cu
#define SDIO_HOST_bSDIO_Write_DP__DP_AUX_CTL_REG 0x4034192Cu
#define SDIO_HOST_bSDIO_Write_DP__DPATH_CFG0 0x40342AC0u
#define SDIO_HOST_bSDIO_Write_DP__DPATH_CFG1 0x40342AC4u
#define SDIO_HOST_bSDIO_Write_DP__DPATH_CFG2 0x40342AC8u
#define SDIO_HOST_bSDIO_Write_DP__DPATH_CFG3 0x40342ACCu
#define SDIO_HOST_bSDIO_Write_DP__DPATH_CFG4 0x40342AD0u
#define SDIO_HOST_bSDIO_Write_DP__DPATH_OPC0 0x40342AE4u
#define SDIO_HOST_bSDIO_Write_DP__DPATH_OPC1 0x40342AE8u
#define SDIO_HOST_bSDIO_Write_DP__DPATH_OPC2 0x40342AECu
#define SDIO_HOST_bSDIO_Write_DP__DPATH_OPC3 0x40342AF0u
#define SDIO_HOST_bSDIO_Write_DP__F0_F1_REG 0x4034022Cu
#define SDIO_HOST_bSDIO_Write_DP__F0_REG 0x4034142Cu
#define SDIO_HOST_bSDIO_Write_DP__F1_REG 0x4034152Cu
#define SDIO_HOST_bSDIO_Write_DP__MSK_DP_AUX_CTL_REG 0x4034042Cu
#define SDIO_HOST_bSDIO_Write_DP__PER_DP_AUX_CTL_REG 0x4034042Cu
#define SDIO_HOST_bSDIO_Write_DP__RC_CFG0 0x40342ADCu
#define SDIO_HOST_bSDIO_Write_DP__RC_CFG1 0x40342AE0u
#define SDIO_HOST_bSDIO_Write_DP_PO__CONTROL_AUX_CTL_REG 0x4034192Cu
#define SDIO_HOST_bSDIO_Write_DP_PO__CONTROL_REG 0x4034172Cu
#define SDIO_HOST_bSDIO_Write_DP_PO__CONTROL_ST_REG 0x4034032Cu
#define SDIO_HOST_bSDIO_Write_DP_PO__COUNT_REG 0x4034172Cu
#define SDIO_HOST_bSDIO_Write_DP_PO__COUNT_ST_REG 0x4034032Cu
#define SDIO_HOST_bSDIO_Write_DP_PO__MASK_CTL_AUX_CTL_REG 0x4034042Cu
#define SDIO_HOST_bSDIO_Write_DP_PO__PER_CTL_AUX_CTL_REG 0x4034042Cu
#define SDIO_HOST_bSDIO_Write_DP_PO__PERIOD_REG 0x4034182Cu
#define SDIO_HOST_bSDIO_Write_DP_PO__RC_CFG0 0x40342ADCu
#define SDIO_HOST_bSDIO_Write_DP_PO__RC_CFG1 0x40342AE0u
#define SDIO_HOST_bSDIO_Write_DP_PO__SC_CFG0 0x40342AD4u
#define SDIO_HOST_bSDIO_Write_DP_PO__SC_CFG1 0x40342AD8u
#define SDIO_HOST_bSDIO_writeCrcCounter__16BIT_CONTROL_AUX_CTL_REG 0x4034191Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__16BIT_CONTROL_CONTROL_REG 0x4034171Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__16BIT_CONTROL_COUNT_REG 0x4034171Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__16BIT_COUNT_CONTROL_REG 0x4034171Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__16BIT_COUNT_COUNT_REG 0x4034171Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__16BIT_MASK_MASK_REG 0x4034181Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__16BIT_MASK_PERIOD_REG 0x4034181Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__16BIT_PERIOD_MASK_REG 0x4034181Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__16BIT_PERIOD_PERIOD_REG 0x4034181Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__32BIT_CONTROL_AUX_CTL_REG 0x4034191Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__32BIT_CONTROL_REG 0x4034171Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__32BIT_COUNT_REG 0x4034171Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__32BIT_PERIOD_REG 0x4034181Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__CONTROL_AUX_CTL_REG 0x4034191Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__CONTROL_REG 0x4034171Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__CONTROL_ST_REG 0x4034031Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__COUNT_REG 0x4034171Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__COUNT_ST_REG 0x4034031Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__MASK_CTL_AUX_CTL_REG 0x4034041Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__PER_CTL_AUX_CTL_REG 0x4034041Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__PERIOD_REG 0x4034181Cu
#define SDIO_HOST_bSDIO_writeCrcCounter__RC_CFG0 0x403426DCu
#define SDIO_HOST_bSDIO_writeCrcCounter__RC_CFG1 0x403426E0u
#define SDIO_HOST_bSDIO_writeCrcCounter__SC_CFG0 0x403426D4u
#define SDIO_HOST_bSDIO_writeCrcCounter__SC_CFG1 0x403426D8u
#define SDIO_HOST_bSDIO_writeCrcCounter_ST__16BIT_STATUS_AUX_CTL_REG 0x4034191Cu
#define SDIO_HOST_bSDIO_writeCrcCounter_ST__16BIT_STATUS_REG 0x4034161Cu
#define SDIO_HOST_bSDIO_writeCrcCounter_ST__32BIT_MASK_REG 0x4034181Cu
#define SDIO_HOST_bSDIO_writeCrcCounter_ST__32BIT_STATUS_AUX_CTL_REG 0x4034191Cu
#define SDIO_HOST_bSDIO_writeCrcCounter_ST__32BIT_STATUS_REG 0x4034161Cu
#define SDIO_HOST_bSDIO_writeCrcCounter_ST__MASK_REG 0x4034181Cu
#define SDIO_HOST_bSDIO_writeCrcCounter_ST__MASK_ST_AUX_CTL_REG 0x4034041Cu
#define SDIO_HOST_bSDIO_writeCrcCounter_ST__PER_ST_AUX_CTL_REG 0x4034041Cu
#define SDIO_HOST_bSDIO_writeCrcCounter_ST__RC_CFG0 0x403426DCu
#define SDIO_HOST_bSDIO_writeCrcCounter_ST__RC_CFG1 0x403426E0u
#define SDIO_HOST_bSDIO_writeCrcCounter_ST__SC_CFG0 0x403426D4u
#define SDIO_HOST_bSDIO_writeCrcCounter_ST__SC_CFG1 0x403426D8u
#define SDIO_HOST_bSDIO_writeCrcCounter_ST__STATUS_AUX_CTL_REG 0x4034191Cu
#define SDIO_HOST_bSDIO_writeCrcCounter_ST__STATUS_CNT_REG 0x4034031Cu
#define SDIO_HOST_bSDIO_writeCrcCounter_ST__STATUS_CONTROL_REG 0x4034031Cu
#define SDIO_HOST_bSDIO_writeCrcCounter_ST__STATUS_REG 0x4034161Cu

