dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_CYW9P62S1_43012EVB_01/SDIO_HOST/SDIO_HOST_cfg.h
/* SDIO_HOST_CMD_DMA */
#define SDIO_HOST_CMD_DMA_DW__BLOCK_HW DW0
#define SDIO_HOST_CMD_DMA_DW__BLOCK_NUMBER 0u
#define SDIO_HOST_CMD_DMA_DW__CHANNEL_HW DW0_CH_STRUCT1
#define SDIO_HOST_CMD_DMA_DW__CHANNEL_NUMBER 1u
#define SDIO_HOST_CMD_DMA_DW__TR_IN TRIG0_OUT_CPUSS_DW0_TR_IN1

/* SDIO_HOST_Internal_Clock */
#define SDIO_HOST_Internal_Clock__DIV_IDX 0
#define SDIO_HOST_Internal_Clock__DIV_NUM 0
#define SDIO_HOST_Internal_Clock__DIV_TYPE CY_SYSCLK_DIV_8_BIT

/* Miscellaneous */
#define SDIO_HOST_Read_DMA_DW__BLOCK_HW DW1
#define SDIO_HOST_Read_DMA_DW__BLOCK_NUMBER 1u
#define SDIO_HOST_Read_DMA_DW__CHANNEL_HW DW1_CH_STRUCT3
#define SDIO_HOST_Read_DMA_DW__CHANNEL_NUMBER 3u
#define SDIO_HOST_Read_DMA_DW__TR_IN TRIG1_OUT_CPUSS_DW1_TR_IN3
#define SDIO_HOST_Resp_DMA_DW__BLOCK_HW DW0
#define SDIO_HOST_Resp_DMA_DW__BLOCK_NUMBER 0u
#define SDIO_HOST_Resp_DMA_DW__CHANNEL_HW DW0_CH_STRUCT0
#define SDIO_HOST_Resp_DMA_DW__CHANNEL_NUMBER 0u
#define SDIO_HOST_Resp_DMA_DW__TR_IN TRIG0_OUT_CPUSS_DW0_TR_IN0
#define SDIO_HOST_Write_DMA_DW__BLOCK_HW DW1
#define SDIO_HOST_Write_DMA_DW__BLOCK_NUMBER 1u
#define SDIO_HOST_Write_DMA_DW__CHANNEL_HW DW1_CH_STRUCT1
#define SDIO_HOST_Write_DMA_DW__CHANNEL_NUMBER 1u
#define SDIO_HOST_Write_DMA_DW__TR_IN TRIG1_OUT_CPUSS_DW1_TR_IN1

/***************************CMD DMA***************************************/
#define SDIO_HOST_CMD_DMA_DW_BLOCK       (0u)
#define SDIO_HOST_CMD_DMA_DW_CHANNEL     (1u)
#define SDIO_HOST_CMD_DMA_HW             (DW0)
#define SDIO_HOST_CMD_DMA_INTR_MASK      (CY_DMA_INTR_MASK)

/* Channel settings */
#define SDIO_HOST_CMD_DMA_PRIORITY       (1u)
#define SDIO_HOST_CMD_DMA_DESCRIPTOR_NUM (1u)
#define SDIO_HOST_CMD_DMA_PREEMPTABLE    (true)
#define SDIO_HOST_CMD_DMA_BUFFERABLE     (false)

extern cy_stc_dma_descriptor_config_t SDIO_HOST_CMD_DMA_CMD_DMA_Desc_config;
extern cy_stc_dma_descriptor_t SDIO_HOST_CMD_DMA_CMD_DMA_Desc;

/***************************Read DMA***************************************/
#define SDIO_HOST_Read_DMA_DW_BLOCK       (1u)
#define SDIO_HOST_Read_DMA_DW_CHANNEL     (3u)
#define SDIO_HOST_Read_DMA_HW             (DW1)
#define SDIO_HOST_Read_DMA_INTR_MASK      (CY_DMA_INTR_MASK)

/* Channel settings */
#define SDIO_HOST_Read_DMA_PRIORITY       (0u)
#define SDIO_HOST_Read_DMA_DESCRIPTOR_NUM (1u)
#define SDIO_HOST_Read_DMA_PREEMPTABLE    (false)
#define SDIO_HOST_Read_DMA_BUFFERABLE     (false)

extern cy_stc_dma_descriptor_config_t SDIO_HOST_Read_DMA_Read_DMA_Desc_config;
extern cy_stc_dma_descriptor_t SDIO_HOST_Read_DMA_Read_DMA_Desc;

/***************************Resp DMA***************************************/
#define SDIO_HOST_Resp_DMA_DW_BLOCK       (0u)
#define SDIO_HOST_Resp_DMA_DW_CHANNEL     (0u)
#define SDIO_HOST_Resp_DMA_HW             (DW0)
#define SDIO_HOST_Resp_DMA_INTR_MASK      (CY_DMA_INTR_MASK)

/* Channel settings */
#define SDIO_HOST_Resp_DMA_PRIORITY       (1u)
#define SDIO_HOST_Resp_DMA_DESCRIPTOR_NUM (1u)
#define SDIO_HOST_Resp_DMA_PREEMPTABLE    (true)
#define SDIO_HOST_Resp_DMA_BUFFERABLE     (false)

extern cy_stc_dma_descriptor_config_t SDIO_HOST_Resp_DMA_Resp_DMA_Desc_config;
extern cy_stc_dma_descriptor_t SDIO_HOST_Resp_DMA_Resp_DMA_Desc;

/***************************Write DMA***************************************/
#define SDIO_HOST_Write_DMA_DW_BLOCK       (1u)
#define SDIO_HOST_Write_DMA_DW_CHANNEL     (1u)
#define SDIO_HOST_Write_DMA_HW             (DW1)
#define SDIO_HOST_Write_DMA_INTR_MASK      (CY_DMA_INTR_MASK)

/* Channel settings */
#define SDIO_HOST_Write_DMA_PRIORITY       (0u)
#define SDIO_HOST_Write_DMA_DESCRIPTOR_NUM (1u)
#define SDIO_HOST_Write_DMA_PREEMPTABLE    (false)
#define SDIO_HOST_Write_DMA_BUFFERABLE     (true)

extern cy_stc_dma_descriptor_config_t SDIO_HOST_Write_DMA_Write_DMA_Desc_config;
extern cy_stc_dma_descriptor_t SDIO_HOST_Write_DMA_Write_DMA_Desc;

/***************************SDIO Clock**************************************/
/** The peripheral clock divider number */
#define SDIO_HOST_Internal_Clock_DIV_NUM ((uint32_t)SDIO_HOST_Internal_Clock__DIV_NUM)
/** The peripheral clock divider type */
#define SDIO_HOST_Internal_Clock_DIV_TYPE ((cy_en_divider_types_t)SDIO_HOST_Internal_Clock__DIV_TYPE)

/*Function for configuring UDBs*/
void SDIO_Host_Config_UDBs(void);

/* SDIO_HOST_Read_Int */
#define SDIO_HOST_Read_Int__INTC_CORTEXM4_ASSIGNED 1
#define SDIO_HOST_Read_Int__INTC_CORTEXM4_PRIORITY 7u
#define SDIO_HOST_Read_Int__INTC_NUMBER 69u
#define SDIO_HOST_Read_Int_INTC_CORTEXM4_ASSIGNED 1
#define SDIO_HOST_Read_Int_INTC_CORTEXM4_PRIORITY 7u
#define SDIO_HOST_Read_Int_INTC_NUMBER 69u

/* SDIO_HOST_sdio_int */
#define SDIO_HOST_sdio_int__INTC_CORTEXM4_ASSIGNED 1
#define SDIO_HOST_sdio_int__INTC_CORTEXM4_PRIORITY 7u
#define SDIO_HOST_sdio_int__INTC_NUMBER 122u
#define SDIO_HOST_sdio_int_INTC_CORTEXM4_ASSIGNED 1
#define SDIO_HOST_sdio_int_INTC_CORTEXM4_PRIORITY 7u
#define SDIO_HOST_sdio_int_INTC_NUMBER 122u

/* SDIO_HOST_Write_Int */
#define SDIO_HOST_Write_Int__INTC_CORTEXM4_ASSIGNED 1
#define SDIO_HOST_Write_Int__INTC_CORTEXM4_PRIORITY 7u
#define SDIO_HOST_Write_Int__INTC_NUMBER 67u
#define SDIO_HOST_Write_Int_INTC_CORTEXM4_ASSIGNED 1
#define SDIO_HOST_Write_Int_INTC_CORTEXM4_PRIORITY 7u
#define SDIO_HOST_Write_Int_INTC_NUMBER 67u

#if defined(__cplusplus)
}
#endif

#endif /* !defined(CY_SDIO_CFG_H) */

/* [] END OF FILE */
